# -*- coding: utf-8 -*-
"""
Created on Sun Oct  9 11:48:20 2022

@author: 李立宗
计算机视觉40例，电子工业出版社，第24章 深度学习应用实践
"""

import cv2
image = cv2.imread("image/x.jpg")         
# 初始化窗口及其置信度
# 窗口
boxes=[[111, 147, 680, 331], [150, 90, 667, 351],  [69, 46, 681, 402], [189, 25, 668, 303], 
       [95, 119, 673, 340], [44, 100, 687, 358], [121, 179, 638,300], 
       [159, 59, 672, 547], 
     [508, 66, 288, 300], [458, 56, 268, 320],   [509, 2, 288, 301],
       [423, 302, 324, 233], [433, 372, 324, 233],[453, 342, 324, 233]]
# 置信度
confidences=[ 0.8727190494537354, 0.7452741861343384, 0.9958364367485046, 0.978717565536499, 
             0.905242178440094, 0.9866145253181458, 0.9464831948280334, 
             0.7797505855560303, 0.9638967514038086,
             0.5467395782470703,0.5347395782470703,0.6148457527160645, 
             0.7797505855560303, 0.6638967514038086]
# =============================================================================
# 显示函数            
# =============================================================================
def display(boxes,image,frame_name,indexes):
    # ===========绘制边框===========
    # 绘制边框及置信度
    color=(255,0,0) 
    Textcolor=(0,0,255)
    for i in range(len(boxes)):
        if i in indexes:
            x, y, w, h = boxes[i]
            cv2.rectangle(image, (x, y), (x+w, y+h), color, 2)
            result = "{:.0f}%".format(confidences[i]*100)
            cv2.putText(image, result, (x, y+35), cv2.FONT_HERSHEY_SIMPLEX, 0.8, Textcolor, 2)  
    cv2.imshow(frame_name, image) 
# =============================================================================
# 不进行非极大值抑制（NMS）处理结果 
# =============================================================================
display(boxes,image.copy(),"noNMS",range(len(boxes)))
# =============================================================================
# 进行非极大值抑制（NMS）处理结果 
# =============================================================================            
# 非极大值抑制，将众多重合的边框保留一个最关键的（去重处理）
indexes = cv2.dnn.NMSBoxes(boxes, confidences,0.5,0.4)
# indexes，所有可能边框的序号集合（需要注意，indexes表示的是boxes内的序号）
display(boxes,image.copy(),"NMS",indexes)
# 窗口控制
cv2.waitKey(0)
cv2.destroyAllWindows()